# Разместить тестовые файлы в пакет tests не получилось. Все делал как в предыдущих лекциях. 
# Тем не менее не смог импортировать модули и функции из более верхней директории. 
# Как с этим бороться так и не понял. Буду благодарен за ссылки на материалы по импорту мобудей и пакетов. 
# В нарушение пайтон стал разместил тесты в одной директории с исполняемым файлом.

import pytest

from main import doc_shelf, doc_num, all_doc_list, add_doc, doc_delete

                                                                                                                                                                                                                                                                                                                                                
def test_doc_shelf():
    assert doc_shelf("10006") == "2"

def test_doc_num():
    assert doc_num("10006") == "Аристарх Павлов"

def test_all_doc_list():
    assert all_doc_list() == ("\npassport 2207 876234 Василий Гупкин\ninvoice 11-2 Геннадий Покемонов\ninsurance 10006 Аристарх Павлов")

def test_add_doc():
    assert add_doc('название документа', '11111', 'Иванов Иван Иванович', '3') == (
    [{"type": "passport", "number": "2207 876234", "name": "Василий Гупкин"},
    {"type": "invoice", "number": "11-2", "name": "Геннадий Покемонов"},
    {"type": "insurance", "number": "10006", "name": "Аристарх Павлов"},
    {"type": 'название документа', "number": '11111', "name": 'Иванов Иван Иванович'}], 
    {'1': ['2207 876234', '11-2', '5455 028765'],
     '2': ['10006'],
     '3': ['11111']})

def test_doc_delete():
    assert doc_delete('10006') == (
    {'1': ['2207 876234', '11-2', '5455 028765'],
     '2': [],
     '3': []},
    [{"type": "passport", "number": "2207 876234", "name": "Василий Гупкин"},
    {"type": "invoice", "number": "11-2", "name": "Геннадий Покемонов"}])




# documents = [
#         {"type": "passport", "number": "2207 876234", "name": "Василий Гупкин"},
#         {"type": "invoice", "number": "11-2", "name": "Геннадий Покемонов"},
#         {"type": "insurance", "number": "10006", "name": "Аристарх Павлов"}
#       ]

directories = {
        '1': ['2207 876234', '11-2', '5455 028765'],
        '2': ['10006'],
        '3': []}
 